; domain
(define (domain sobokosnake)
(:requirements :typing :negative-preconditions)
(:types location direction - object)
(:predicates
    ;up down left right of a field
    (MOVE-DIR ?x ?y - location ?dir - direction)
    ;snake that has not eaten anything yet
    (thinsnake ?x - location)
    ;the last field of the snake
    (tailsnake ?x - location)
    ;the first field of the snake
    (headsnake ?x - location)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y - location)
    ;a field that is occupied by the snake or by a hole
    (blocked ?x - location)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x - location)
    ;a field that is occupied by an obstacle
    (isbox ?x - location)
    ;a field that has a hole on it
    (ishole ?x - location)
)

(:action move-thin-snake
    ;move thin snake
    :parameters (?oldposition ?newposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (not (blocked ?newposition))
        (not (ispoint ?newposition))
        (not (isbox ?newposition))
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
    )
)
(:action move-thin-snake-and-box
    ;move thin snake and push box
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (not (isbox ?newboxposition))
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (isbox ?newboxposition)
    )
)
(:action move-thin-snake-and-box-to-hole
    ;move thin snake and push box to a hole
    :parameters (?oldposition ?newposition ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?oldposition)
        (MOVE-DIR ?oldposition ?newposition ?dir)
        (MOVE-DIR ?newposition ?newboxposition ?dir)
        (not (ispoint ?newposition))
        (isbox ?newposition)
        (ishole ?newboxposition)
        
    )
    :effect
    (and
        (thinsnake ?newposition)
        (blocked ?newposition)
        (not (thinsnake ?oldposition))
        (not (blocked ?oldposition))
        (not (isbox ?newposition))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)



(:action move-thin-snake-and-first-eat
    ;move thin snake and eat
    :parameters (?position ?newhead - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
    )
)
(:action move-box-and-first-eat
    ;move thin snake, push box and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-first-eat
    ;move thin snake, push box to a hole and eat
    :parameters (?position ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (thinsnake ?position)
        (MOVE-DIR ?position ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (tailsnake ?position)
        (nextsnake ?newhead ?position)
        (not (ispoint ?newhead))
        (not (thinsnake ?position))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-fat-snake
    ;move snake
    :parameters (?head ?newhead ?tail ?newtail - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)
(:action move-fat-snake-and-box
    ;move snake and push box
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newboxposition))
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-fat-snake-and-box-to-hole
    ;move snake and push box to a hole
    :parameters (?head ?newhead ?tail ?newtail ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (ispoint ?newhead))
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
(:action move-and-eat
    ;move snake and eat
    :parameters (?head ?newhead - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (not (isbox ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)
(:action move-box-and-eat
    ;move snake, push box and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (not (blocked ?newboxposition))
        (ispoint ?newhead)
        (isbox ?newhead)
        (not (isbox ?newboxposition))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (isbox ?newboxposition)
    )
)
(:action move-box-to-hole-and-eat
    ;move snake, push box to a hole and eat
    :parameters (?head ?newhead ?newboxposition - location ?dir - direction)
    :precondition
    (and
        (not (thinsnake ?head))
        (headsnake ?head)
        (MOVE-DIR ?head ?newhead ?dir)
        (MOVE-DIR ?newhead ?newboxposition ?dir)
        (ispoint ?newhead)
        (isbox ?newhead)
        (ishole ?newboxposition)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (not (isbox ?newhead))
        (not (ishole ?newboxposition))
        (not (blocked ?newboxposition))
    )
)
)

; problem
(define (problem sobokosnake-2-1)
(:domain sobokosnake)
(:objects
    pos0-0 - location
    pos0-1 - location
    pos0-2 - location
    pos0-4 - location
    pos0-5 - location
    pos0-6 - location
    pos1-0 - location
    pos1-1 - location
    pos1-2 - location
    pos1-3 - location
    pos1-4 - location
    pos1-5 - location
    pos1-6 - location
    pos2-0 - location
    pos2-1 - location
    pos2-2 - location
    pos2-4 - location
    pos2-5 - location
    pos2-6 - location
    dir-right - direction
    dir-left - direction
    dir-up - direction
    dir-down - direction
)
(:init
    (MOVE-DIR pos0-0 pos0-1 dir-right)
    (MOVE-DIR pos0-0 pos1-0 dir-down)
    (MOVE-DIR pos0-1 pos0-0 dir-left)
    (MOVE-DIR pos0-1 pos0-2 dir-right)
    (MOVE-DIR pos0-1 pos1-1 dir-down)
    (MOVE-DIR pos0-2 pos0-1 dir-left)
    (MOVE-DIR pos0-2 pos1-2 dir-down)
    (MOVE-DIR pos0-4 pos0-5 dir-right)
    (MOVE-DIR pos0-4 pos1-4 dir-down)
    (MOVE-DIR pos0-5 pos0-6 dir-right)
    (MOVE-DIR pos0-5 pos0-4 dir-left)
    (MOVE-DIR pos0-5 pos1-5 dir-down)
    (MOVE-DIR pos0-6 pos0-5 dir-left)
    (MOVE-DIR pos0-6 pos1-6 dir-down)
    (MOVE-DIR pos1-0 pos1-1 dir-right)
    (MOVE-DIR pos1-0 pos0-0 dir-up)
    (MOVE-DIR pos1-0 pos2-0 dir-down)
    (MOVE-DIR pos1-1 pos1-2 dir-right)
    (MOVE-DIR pos1-1 pos1-0 dir-left)
    (MOVE-DIR pos1-1 pos0-1 dir-up)
    (MOVE-DIR pos1-1 pos2-1 dir-down)
    (MOVE-DIR pos1-2 pos1-3 dir-right)
    (MOVE-DIR pos1-2 pos1-1 dir-left)
    (MOVE-DIR pos1-2 pos0-2 dir-up)
    (MOVE-DIR pos1-2 pos2-2 dir-down)
    (MOVE-DIR pos1-3 pos1-4 dir-right)
    (MOVE-DIR pos1-3 pos1-2 dir-left)
    (MOVE-DIR pos1-4 pos1-5 dir-right)
    (MOVE-DIR pos1-4 pos2-4 dir-down)
    (MOVE-DIR pos1-4 pos1-3 dir-left)
    (MOVE-DIR pos1-4 pos0-4 dir-up)
    (MOVE-DIR pos1-5 pos1-6 dir-right)
    (MOVE-DIR pos1-5 pos1-4 dir-left)
    (MOVE-DIR pos1-5 pos2-5 dir-down)
    (MOVE-DIR pos1-5 pos0-5 dir-up)
    (MOVE-DIR pos1-6 pos1-5 dir-left)
    (MOVE-DIR pos1-6 pos2-6 dir-down)
    (MOVE-DIR pos1-6 pos0-6 dir-up)
    (MOVE-DIR pos2-0 pos2-1 dir-right)
    (MOVE-DIR pos2-0 pos1-0 dir-up)
    (MOVE-DIR pos2-1 pos2-2 dir-right)
    (MOVE-DIR pos2-1 pos2-0 dir-left)
    (MOVE-DIR pos2-1 pos1-1 dir-up)
    (MOVE-DIR pos2-2 pos2-1 dir-left)
    (MOVE-DIR pos2-2 pos1-2 dir-up)
    (MOVE-DIR pos2-4 pos2-5 dir-right)
    (MOVE-DIR pos2-4 pos1-4 dir-up)
    (MOVE-DIR pos2-5 pos2-6 dir-right)
    (MOVE-DIR pos2-5 pos2-4 dir-left)
    (MOVE-DIR pos2-5 pos1-5 dir-up)
    (MOVE-DIR pos2-6 pos2-5 dir-left)
    (MOVE-DIR pos2-6 pos1-6 dir-up)
    ;(tailsnake pos2-1)
    ;(headsnake pos2-1)
    (thinsnake pos1-0)
    (blocked pos1-0)
    (ispoint pos0-0)
    (ispoint pos0-2)
    (ispoint pos0-5)
    (ispoint pos1-1)
    (ispoint pos1-5)
    (ispoint pos1-6)
    (ispoint pos2-0)
    (ispoint pos2-2)
    (ispoint pos2-5)
    (isbox pos1-3)
)
(:goal
(and
    (not (ispoint pos0-0))
    (not (ispoint pos0-2))
    (not (ispoint pos0-5))
    (not (ispoint pos1-1))
    (not (ispoint pos1-5))
    (not (ispoint pos1-6))
    (not (ispoint pos2-0))
    (not (ispoint pos2-2))
    (not (ispoint pos2-5))
)
)
)

; plan
1. (move-thin-snake-and-first-eat pos1-0 pos1-1 dir-right)
   deleted: (ispoint pos1-1) (thinsnake pos1-0)
   added: (blocked pos1-1) (headsnake pos1-1) (tailsnake pos1-0) (nextsnake pos1-1 pos1-0)
   goals met: 1 of 9
2. (move-fat-snake pos1-1 pos1-2 pos1-0 pos1-1 dir-right)
   deleted: (headsnake pos1-1) (blocked pos1-0) (tailsnake pos1-0) (nextsnake pos1-1 pos1-0)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos1-1) (tailsnake pos1-1)
   goals met: 1 of 9
3. (move-and-eat pos1-2 pos0-2 dir-up)
   deleted: (headsnake pos1-2) (ispoint pos0-2)
   added: (blocked pos0-2) (headsnake pos0-2) (nextsnake pos0-2 pos1-2)
   goals met: 2 of 9
4. (move-fat-snake pos0-2 pos0-1 pos1-1 pos1-2 dir-left)
   deleted: (headsnake pos0-2) (blocked pos1-1) (tailsnake pos1-1) (nextsnake pos1-2 pos1-1)
   added: (blocked pos0-1) (headsnake pos0-1) (nextsnake pos0-1 pos0-2) (tailsnake pos1-2)
   goals met: 2 of 9
5. (move-and-eat pos0-1 pos0-0 dir-left)
   deleted: (headsnake pos0-1) (ispoint pos0-0)
   added: (blocked pos0-0) (headsnake pos0-0) (nextsnake pos0-0 pos0-1)
   goals met: 3 of 9
6. (move-fat-snake pos0-0 pos1-0 pos1-2 pos0-2 dir-down)
   deleted: (headsnake pos0-0) (blocked pos1-2) (tailsnake pos1-2) (nextsnake pos0-2 pos1-2)
   added: (blocked pos1-0) (headsnake pos1-0) (nextsnake pos1-0 pos0-0) (tailsnake pos0-2)
   goals met: 3 of 9
7. (move-and-eat pos1-0 pos2-0 dir-down)
   deleted: (headsnake pos1-0) (ispoint pos2-0)
   added: (blocked pos2-0) (headsnake pos2-0) (nextsnake pos2-0 pos1-0)
   goals met: 4 of 9
8. (move-fat-snake pos2-0 pos2-1 pos0-2 pos0-1 dir-right)
   deleted: (headsnake pos2-0) (blocked pos0-2) (tailsnake pos0-2) (nextsnake pos0-1 pos0-2)
   added: (blocked pos2-1) (headsnake pos2-1) (nextsnake pos2-1 pos2-0) (tailsnake pos0-1)
   goals met: 4 of 9
9. (move-and-eat pos2-1 pos2-2 dir-right)
   deleted: (headsnake pos2-1) (ispoint pos2-2)
   added: (blocked pos2-2) (headsnake pos2-2) (nextsnake pos2-2 pos2-1)
   goals met: 5 of 9
10. (move-fat-snake pos2-2 pos1-2 pos0-1 pos0-0 dir-up)
   deleted: (headsnake pos2-2) (blocked pos0-1) (tailsnake pos0-1) (nextsnake pos0-0 pos0-1)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos2-2) (tailsnake pos0-0)
   goals met: 5 of 9
11. (move-fat-snake-and-box pos1-2 pos1-3 pos0-0 pos1-0 pos1-4 dir-right)
   deleted: (headsnake pos1-2) (blocked pos0-0) (tailsnake pos0-0) (nextsnake pos1-0 pos0-0) (isbox pos1-3)
   added: (blocked pos1-3) (headsnake pos1-3) (nextsnake pos1-3 pos1-2) (tailsnake pos1-0) (isbox pos1-4)
   goals met: 5 of 9
12. (move-fat-snake-and-box pos1-3 pos1-4 pos1-0 pos2-0 pos1-5 dir-right)
   deleted: (headsnake pos1-3) (blocked pos1-0) (tailsnake pos1-0) (nextsnake pos2-0 pos1-0) (isbox pos1-4)
   added: (blocked pos1-4) (headsnake pos1-4) (nextsnake pos1-4 pos1-3) (tailsnake pos2-0) (isbox pos1-5)
   goals met: 5 of 9
13. (move-fat-snake pos1-4 pos0-4 pos2-0 pos2-1 dir-up)
   deleted: (headsnake pos1-4) (blocked pos2-0) (tailsnake pos2-0) (nextsnake pos2-1 pos2-0)
   added: (blocked pos0-4) (headsnake pos0-4) (nextsnake pos0-4 pos1-4) (tailsnake pos2-1)
   goals met: 5 of 9
14. (move-and-eat pos0-4 pos0-5 dir-right)
   deleted: (headsnake pos0-4) (ispoint pos0-5)
   added: (blocked pos0-5) (headsnake pos0-5) (nextsnake pos0-5 pos0-4)
   goals met: 6 of 9
15. (move-box-and-eat pos0-5 pos1-5 pos2-5 dir-down)
   deleted: (headsnake pos0-5) (ispoint pos1-5) (isbox pos1-5)
   added: (blocked pos1-5) (headsnake pos1-5) (nextsnake pos1-5 pos0-5) (isbox pos2-5)
   goals met: 7 of 9
16. (move-and-eat pos1-5 pos1-6 dir-right)
   deleted: (headsnake pos1-5) (ispoint pos1-6)
   added: (blocked pos1-6) (headsnake pos1-6) (nextsnake pos1-6 pos1-5)
   goals met: 8 of 9
17. (move-fat-snake pos1-6 pos2-6 pos2-1 pos2-2 dir-down)
   deleted: (headsnake pos1-6) (blocked pos2-1) (tailsnake pos2-1) (nextsnake pos2-2 pos2-1)
   added: (blocked pos2-6) (headsnake pos2-6) (nextsnake pos2-6 pos1-6) (tailsnake pos2-2)
   goals met: 8 of 9
18. (move-box-and-eat pos2-6 pos2-5 pos2-4 dir-left)
   deleted: (headsnake pos2-6) (ispoint pos2-5) (isbox pos2-5)
   added: (blocked pos2-5) (headsnake pos2-5) (nextsnake pos2-5 pos2-6) (isbox pos2-4)
   goals met: 9 of 9
